Repository: pingfangx/TranslatorX-other
Catalog: JavaDocs/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: New tasks submitted in method execute(Runnable) will be rejected when the Executor has been shut down, and also when the Executor uses finite bounds for both maximum threads and work queue capacity, and is saturated.
zh_cn: 当 Executor 已经关闭，并且 Executor 将有限边界用于最大线程和工作队列容量，且已经饱和时，在方法 execute(Runnable) 中提交的新任务将被拒绝。

source: New threads are created using a ThreadFactory.
zh_cn: 使用 ThreadFactory 创建新线程。

source: New throwable classes that wish to allow causes to be associated with them should provide constructors that take a cause and delegate (perhaps indirectly) to one of the Throwable constructors that takes a cause.
zh_cn: 对于那些希望将 cause 与其关联起来的新 throwable 类，应该提供带有 cause 的构造方法，并委托（可能间接）给一个带有 cause 的 Throwable 构造方法。

source: No flipping or rewinding of the buffer is performed.
zh_cn: 不对缓冲区进行翻转或重绕操作。

source: No two elements in the interfaces array may refer to identical Class objects.
zh_cn: interfaces 数组中的两个元素不能引用同一 Class 对象。

source: Normally the child's values will be identical to the parent's; however, the child's value can be made an arbitrary function of the parent's by overriding the childValue method in this class.
zh_cn: 通常，子线程的值与父线程的值是一致的；但是，通过重写这个类中的 childValue 方法，子线程的值可以作为父线程值的一个任意函数。

source: Normally, the Java virtual machine loads classes from the local file system in a platform-dependent manner.
zh_cn: 通常情况下，Java 虚拟机以与平台有关的方式，从本地文件系统中加载类。

source: Normally, this error is caught by the compiler; this error can only occur at run time if the definition of some class has incompatibly changed since the currently executing method was last compiled.
zh_cn: 通常由编译器捕获此错误；如果某个类的定义自当前执行方法最后一次编译以后作了不兼容的更改，则此错误只可能在运行时发生。

source: Normally, this method is invoked at most once per thread, but it may be invoked again in case of subsequent invocations of remove() followed by get().
zh_cn: 通常，此方法对每个线程最多调用一次，但如果在调用 get() 后又调用了 remove()，则可能再次调用此方法。

source: Not all approximations that have 1 ulp accuracy will automatically meet the monotonicity requirements.
zh_cn: 并非所有准确性为 1 ulp 的近似值都能自动满足单调性要求。

source: Not all systems have support for the IPv6 protocol, and while the Java networking stack will attempt to detect it and use it transparently when available, it is also possible to disable its use with a system property.
zh_cn: 并非所有系统都支持 IPv6 协议，而当 Java 网络连接堆栈尝试检测它并在可用时透明地使用它时，还可以利用系统属性禁用它。

source: Note also that this meta-annotation only causes annotations to be inherited from superclasses; annotations on implemented interfaces have no effect.
zh_cn: 还要注意，此元注释仅促成从超类继承注释；对已实现接口的注释无效。

source: Note also that when a duplicate method is dispatched to an invocation handler, the invoke method may only throw checked exception types that are assignable to one of the exception types in the throws clause of the method in all of the proxy interfaces that it can be invoked through.
zh_cn: 还要注意，当重复方法被指派到调用处理程序时，invoke 方法只可以抛出经过检查的异常类型，该异常类型可以使用所有 代理接口（可以通过它调用）中方法的 throws 子句指派一种异常类型。

source: Note that null is not an instance of any class, and e.compareTo(null) should throw a NullPointerException even though e.equals(null) returns false.
zh_cn: 注意，null 不是任何类的实例，即使 e.equals(null) 返回 false，e.compareTo(null) 也将抛出 NullPointerException。

source: Note that AbstractMap fields are used for keySet() and values().
zh_cn: 请注意，AbstractMap 的字段用于 keySet() 和 values()。

source: Note that all arrays are considered to implement the interface Cloneable and that the return type of the clone method of an array type T[] is T[] where T is any reference or primitive type.
zh_cn: 注意，所有的数组都被视为实现接口 Cloneable，数组类型 T[] 的 clone 方法的返回类型是 T[]，其中 T 是任何引用或基元类型。

source: Note that an interface that manually extends this one does not define an annotation type.
zh_cn: 注意，手动扩展该公共接口的接口 不 定义 annotation 类型。

source: Note that for a particular enum type T, the implicitly declared public static T valueOf(String) method on that enum may be used instead of this method to map from a name to the corresponding enum constant.
zh_cn: 注意，对于一个特定的枚举类型 T 时，隐式地声明 public static T valueOf(String) 可以用来代替该方法对该枚举方法从名称映射到相应的枚举常量。

source: Note that if no lower bound is explicitly declared, the lower bound is the type of null.
zh_cn: 注意，如果不存在显式声明的下边界，则下边界为类型 null。

source: Note that if no upper bound is explicitly declared, the upper bound is Object.
zh_cn: 注意，如果不存在显式声明的上边界，则上边界为 Object。

source: Note that in some cases, the returned array be empty.
zh_cn: 注意，在某些情况下，返回的数组为空。

source: Note that it is generally necessary to override the hashCode method whenever this method is overridden, so as to maintain the general contract for the hashCode method, which states that equal objects must have equal hash codes.
zh_cn: 注意：当此方法被重写时，通常有必要重写 hashCode 方法，以维护 hashCode 方法的常规协定，该协定声明相等对象必须具有相等的哈希码。

source: Note that package sealing will not prevent a proxy class from being successfully defined in a particular package at runtime, and neither will classes already defined by the same class loader and the same package with particular signers.
zh_cn: 注意，包密封将不阻止代理类在运行时在特定包中的成功定义，也不会阻止相同类加载器和带有特定签名的包所定义的类。

source: Note that supplementary characters may be composed of multiple 16-bit char values.
zh_cn: 注意，增补字符可能由多个 16 位 char 值组成。

source: Note that the wait method, as it places the current thread into the wait set for this object, unlocks only this object; any other objects on which the current thread may be synchronized remain locked while the thread waits.
zh_cn: 注意，由于 wait 方法将当前线程放入了对象的等待集中，所以它只能解除此对象的锁定；可以同步当前线程的任何其他对象在线程等待时仍处于锁定状态。

source: Note that the ClassLoader class is registered as parallel capable by default.
zh_cn: 注意，默认情况下，ClassLoader 类注册为可并行。

source: Note that the Handler class has to be a subclass of the abstract class URLStreamHandler.
zh_cn: 注意，处理程序类 必须 为抽象类 URLStreamHandler 的子类。

source: Note that the detail message associated with cause is not automatically incorporated in this error's detail message.
zh_cn: 注意，与 cause 相关的详细消息不会 自动合并到此错误的详细消息中。

source: Note that the fail-fast behavior of an iterator cannot be guaranteed as it is, generally speaking, impossible to make any hard guarantees in the presence of unsynchronized concurrent modification.
zh_cn: 注意，迭代器的快速失败行为不能得到保证，一般来说，存在非同步的并发修改时，不可能作出任何坚决的保证。

source: Note that the order of the specified proxy interfaces is significant: two requests for a proxy class with the same combination of interfaces but in a different order will result in two distinct proxy classes.
zh_cn: 注意，指定的代理接口的顺序非常重要：对接口组合相同但顺序不同的代理类的两个请求会导致两个不同的代理类。

source: Note that the reverse operation may result in producing surrogate pairs that were unpaired low-surrogates and high-surrogates before the operation.
zh_cn: 注意，进行 reverse 操作后，执行操作前未成对的低代理项和高代理项将成为代理项对。

source: Note that this interface does not contain the clone method.
zh_cn: 注意，此接口不 包含 clone 方法。

source: Note that this meta-annotation type has no effect if the annotated type is used to annotate anything other than a class.
zh_cn: 注意，如果使用注释类型注释类以外的任何事物，此元注释类型都是无效的。

source: Note that using many keys with the same hashCode() is a sure way to slow down performance of any hash table.
zh_cn: 请注意，使用多个具有相同 hashCode() 的键肯定会降低任何哈希表的性能。

source: Note that when using an enumeration type as the type of a set or as the type of the keys in a map, specialized and efficient set and map implementations are available.
zh_cn: 请注意，当使用枚举类型作为集合的类型或映射中键的类型时，可以使用专门且高效的 set 和 map 实现。

source: Note: If the character at the given index is a supplementary character, this method does not remove the entire character.
zh_cn: 注：如果给定索引处的字符是增补字符，则此方法将不会移除整个字符。

source: Notification
zh_cn: 通知

source: ObjectInput extends the DataInput interface to include the reading of objects.
zh_cn: ObjectInput 扩展 DataInput 接口以包含对象的读操作。

source: ObjectOutput extends the DataOutput interface to include writing of objects.
zh_cn: ObjectOutput 扩展 DataOutput 接口以包含对象的写入操作。

source: Objects that implement this interface can be used as keys in a sorted map or as elements in a sorted set, without the need to specify a comparator.
zh_cn: 实现此接口的对象可以用作有序映射中的键或有序集合中的元素，无需指定比较器。

source: On some platforms, the weak version may be more efficient than compareAndSet in the normal case, but differs in that any given invocation of the weakCompareAndSet method may return false spuriously (that is, for no apparent reason).
zh_cn: 在某些平台上，弱版本在正常情况下可能比 compareAndSet 更有效，但不同的是 weakCompareAndSet 方法的任何给定调用可能意外 返回 false（即没有明确的原因）。

source: On-demand construction
zh_cn: 按需构造

source: Once it has downloaded the bytes that make up the class, it should use the method defineClass to create a class instance.
zh_cn: 下载组成该类的字节后，它应该使用方法 defineClass 来创建类实例。

source: One application is to generate sequence numbers, as in:
zh_cn: 一个应用程序将按以下方式生成序列号：

source: One exception is java.math.BigDecimal, whose natural ordering equates BigDecimal objects with equal values and different precisions (such as 4.0 and 4.00).
zh_cn: java.math.BigDecimal 是个例外，它的自然排序将值相等但精确度不同的 BigDecimal 对象（比如 4.0 和 4.00）视为相等。

source: One is to declare a class to be a subclass of Thread.
zh_cn: 一种方法是将类声明为 Thread 的子类。

source: One or more variables that together maintain a running double value updated using a supplied function.
zh_cn: 一个或多个变量，它们一起保持一个运行 double 值。

source: One or more variables that together maintain a running long value updated using a supplied function.
zh_cn: 一个或多个变量，它们一起保持一个运行 long 值。

source: One or more variables that together maintain an initially zero double sum.
zh_cn: 一个或多个变量，它们一起保持初始零 double 总和。

source: One or more variables that together maintain an initially zero long sum.
zh_cn: 一个或多个变量，它们一起保持初始零 long 总和。

source: One reason that a throwable may have a cause is that the class that throws it is built atop a lower layered abstraction, and an operation on the upper layer fails due to a failure in the lower layer.
zh_cn: 导致 throwable cause 的一个理由是，抛出它的类构建在低层抽象之中，而高层操作由于低层操作的失败而失败。

source: Only a single implementation, ReentrantReadWriteLock, is provided, since it covers most standard usage contexts.
zh_cn: 此包只提供了一个实现，即 ReentrantReadWriteLock，因为它适用于大部分的标准用法上下文。

source: Only objects that are instances of this class (or one of its subclasses) are thrown by the Java Virtual Machine or can be thrown by the Java throw statement.
zh_cn: 只有当对象是此类（或其子类之一）的实例时，才能通过 Java 虚拟机或者 Java throw 语句抛出。

source: Only one thread at a time can own an object's monitor.
zh_cn: 一次只能有一个线程拥有对象的监视器。

source: Only the identity of the class of an Externalizable instance is written in the serialization stream and it is the responsibility of the class to save and restore the contents of its instances.
zh_cn: Externalizable 实例类的唯一特性是可以被写入序列化流中，该类负责保存和恢复实例内容。

source: Open for reading, a resource of the specified name from the search path used to load classes.
zh_cn: 从用来加载类的搜索路径打开具有指定名称的资源，以读取该资源。

source: Other portions of the Java API may define other subsets for their own purposes.
zh_cn: Java API 的其他部分可以针对其各自用途定义其他子集。

source: Other public methods of a proxy instance inherited from java.lang.Object are not overridden by a proxy class, so invocations of those methods behave like they do for instances of java.lang.Object.
zh_cn: 代理类不重写从 java.lang.Object 继承的代理实例的其他公共方法，所以这些方法的调用行为与其对 java.lang.Object 实例的操作一样。

source: Other utilities based on Executors include the concrete class FutureTask providing a common extensible implementation of Futures, and ExecutorCompletionService, that assists in coordinating the processing of groups of asynchronous tasks.
zh_cn: 其他基于 Executors 的实用工具包括具体类 FutureTask，它提供 Future 的常见可扩展实现，以及 ExecutorCompletionService，它有助于协调对异步任务组的处理。

source: Otherwise no constraints are placed upon the time at which a soft reference will be cleared or the order in which a set of such references to different objects will be cleared.
zh_cn: 否则，清除软引用的时间或者清除不同对象的一组此类引用的顺序将不受任何约束。

source: Otherwise this method immediately returns null.
zh_cn: 否则此方法立即返回 null。

source: Otherwise, B is resolved.
zh_cn: 否则，B 将被解析。

source: Otherwise, because we are using power-of-two expansion, the elements from each bin must either stay at same index, or move with a power of two offset in the new table.
zh_cn: 否则，因为我们正在使用 2 次幂的扩展，所以每个桶中的元素都必须保持相同的索引，或者在新表中以 2 的幂的偏移量移动。

source: Otherwise, one of the methods must have a return type that is assignable to all of the return types of the rest of the methods.
zh_cn: 否则，该方法之一必须是返回类型，它可以指派给该方法其余的所有返回类型。

source: Otherwise, the char value at the given index is returned.
zh_cn: 否则，返回给定索引上的 char 值。

source: Otherwise, the package of a proxy class is also unspecified.
zh_cn: 否则，代理类的包也是未指定的。

source: Otherwise, this method creates a new instance of the class of this object and initializes all its fields with exactly the contents of the corresponding fields of this object, as if by assignment; the contents of the fields are not themselves cloned.
zh_cn: 否则，此方法会创建此对象的类的一个新实例，并像通过分配那样，严格使用此对象相应字段的内容初始化该对象的所有字段；这些字段的内容没有被自我复制。

source: Otherwise, use the following guide when manually configuring and tuning this class:
zh_cn: 否则，在手动配置和调整此类时，使用以下指导：

source: Output to the stream is piped into the standard input of the process represented by this Process object.
zh_cn: 输出到的流管道输送到由该 Process 对象所表示的进程的标准输入。

source: Over time, a throwable can suppress other throwables from being propagated.
zh_cn: 随着时间的推移，throwable 可以 suppress 被传播的其他 throwable。

source: Overriden method's declaring class (same as declaringClass unless declaringClass is a proxy class)
zh_cn: 覆盖方法的声明类(同 declaringClass 除非 declaringClass 是一个代理类)

source: Overrides of JDK8 Map extension methods
zh_cn: JDK8 映射扩展方法的重写

source: Package Specification
zh_cn: 包规范

source: Package declaration
zh_cn: 包声明

source: ParameterizedType represents a parameterized type such as Collection<String>.
zh_cn: ParameterizedType 表示参数化类型，如 Collection<String>。

source: Parses the string argument as a boolean.
zh_cn: 将字符串参数解析为 boolean 值。

source: Parses the string argument as a signed byte in the radix specified by the second argument.
zh_cn: 将 string 参数解析为一个有符号的 byte，其基数由第二个参数指定。

source: Parses the string argument as a signed long in the radix specified by the second argument.
zh_cn: 将 string 参数解析为有符号的 long，基数由第二个参数指定。

source: Parses the string argument as a signed short in the radix specified by the second argument.
zh_cn: 将字符串参数解析为由第二个参数指定的基数中的有符号的 short。

source: Parses the string argument as a signed decimal byte.
zh_cn: 将 string 参数解析为有符号的十进制 byte。

source: Parses the string argument as a signed decimal long.
zh_cn: 将 string 参数解析为有符号十进制 long。

source: Parses the string argument as a signed decimal short.
zh_cn: 将字符串参数解析为有符号的十进制 short。

source: Parses the string argument as a signed decimal integer.
zh_cn: 将字符串参数作为有符号的十进制整数进行解析。

source: Parses the string argument as a signed integer in the radix specified by the second argument.
zh_cn: 使用第二个参数指定的基数，将字符串参数解析为有符号的整数。

source: Performs the given action for each element of the Iterable until all elements have been processed or the action throws an exception.
zh_cn: 对 Iterable 的每个元素执行给定的操作，直到处理完所有元素或操作引发异常。

source: Performs the given action for each entry in this map until all entries have been processed or the action throws an exception.
zh_cn: 对该映射中的每个条目执行给定操作，直到所有条目都已处理或该操作引发异常。

source: Phantom reference objects, which are enqueued after the collector determines that their referents may otherwise be reclaimed.
zh_cn: 虚引用对象，在回收器确定其指示对象可另外回收之后，被加入队列。

source: Phantom references are most often used for scheduling pre-mortem cleanup actions in a more flexible way than is possible with the Java finalization mechanism.
zh_cn: 虚引用最常见的用法是以某种可能比使用 Java 终结机制更灵活的方式来指派 pre-mortem 清除动作。

source: Piped character-input streams.
zh_cn: 传送的字符输入流。

source: Piped character-output streams.
zh_cn: 传送的字符输出流。

source: Polls this queue to see if a reference object is available.
zh_cn: 轮询此队列，查看是否存在可用的引用对象。

source: Position, limit, and capacity;
zh_cn: 位置，界限和容量；

source: Prints a stack trace of the current thread to the standard error stream.
zh_cn: 将当前线程的堆栈跟踪打印至标准错误流。

source: Prints formatted representations of objects to a text-output stream.
zh_cn: 向文本输出流打印对象的格式化表示形式。

source: Prints information about this thread group to the standard output.
zh_cn: 将有关此线程组的信息打印到标准输出。

source: Prints this throwable and its backtrace to the specified print stream.
zh_cn: 将此 throwable 及其追踪输出到指定的输出流。

source: Prints this throwable and its backtrace to the specified print writer.
zh_cn: 将此 throwable 及其追踪输出到指定的 PrintWriter。

source: Prints this throwable and its backtrace to the standard error stream.
zh_cn: 将此 throwable 及其追踪输出至标准错误流。

source: Processes a method invocation on a proxy instance and returns the result.
zh_cn: 在代理实例上处理方法调用并返回结果。

source: Programmers cannot invoke this constructor.
zh_cn: 程序员不能调用这个构造函数。

source: Protocol Handlers
zh_cn: 协议处理程序

source: Provide access to the persistent fields read from the input stream.
zh_cn: 提供对从输入流读取的持久字段的访问权限。

source: Provide programmatic access to the persistent fields to be written to ObjectOutput.
zh_cn: 提供对要写入 ObjectOutput 的持久字段的编程访问。

source: Provides a framework for implementing blocking locks and related synchronizers (semaphores, events, etc) that rely on first-in-first-out (FIFO) wait queues.
zh_cn: 为实现依赖于先进先出 (FIFO) 等待队列的阻塞锁和相关同步器（信号量、事件，等等）提供一个框架。

source: Provides classes and interfaces for handling text, dates, numbers, and messages in a manner independent of natural languages.
zh_cn: 提供以与自然语言无关的方式来处理文本、日期、数字和消息的类和接口。

source: Provides classes and interfaces for obtaining reflective information about classes and objects.
zh_cn: 提供类和接口，以获得关于类和对象的反射信息。

source: Provides classes that are fundamental to the design of the Java programming language.
zh_cn: 提供利用 Java 编程语言进行程序设计的基础类。

source: Provides default implementations of ExecutorService execution methods.
zh_cn: 提供 ExecutorService 执行方法的默认实现。

source: Provides for system input and output through data streams, serialization and the file system.
zh_cn: 通过数据流、序列化和文件系统提供系统输入和输出。

source: Provides library support for the Java programming language annotation facility.
zh_cn: 为 Java 编程语言注释设施提供库支持。（译注：在其他地方一般译作“注解”，这里来自 api 1.6 中文版，所以沿用“注释”）

source: Provides methods to convert internationalized domain names (IDNs) between a normal Unicode representation and an ASCII Compatible Encoding (ACE) representation.
zh_cn: 提供在普通 Unicode 表示形式和 ASCII 兼容性编码 (ACE) 表示形式之间进行国际化域名 (IDN) 转换的方法。

source: Provides programmatic access to the stack trace information printed by printStackTrace().
zh_cn: 提供编程访问由 printStackTrace() 输出的堆栈跟踪信息。

source: Provides reference-object classes, which support a limited degree of interaction with the garbage collector.
zh_cn: 提供了引用对象类，支持在某种程度上与垃圾回收器之间的交互。

source: Provides the API for accessing and processing data stored in a data source (usually a relational database) using the JavaTM programming language.
zh_cn: 提供使用 JavaTM 编程语言访问并处理存储在数据源（通常是一个关系数据库）中的数据的 API。

source: Provides the classes and interfaces for the security framework.
zh_cn: 为安全框架提供类和接口。

source: Provides the classes for implementing networking applications.
zh_cn: 为实现网络应用程序提供类。

source: Proxy classes are public, final, and not abstract.
zh_cn: 代理类是公共的、最终的，而不是抽象的。

source: Queue maintenance
zh_cn: 队列维护

source: Queue sizes and maximum pool sizes may be traded off for each other: Using large queues and small pools minimizes CPU usage, OS resources, and context-switching overhead, but can lead to artificially low throughput.
zh_cn: 队列大小和最大池大小可能需要相互折衷：使用大型队列和小型池可以最大限度地降低 CPU 使用率、操作系统资源和上下文切换开销，但是可能导致人工降低吞吐量。

source: Queues
zh_cn: 队列

source: Queuing
zh_cn: 排队

source: Rather than having to use the reflection API to access the public constructor, a proxy instance can be also be created by calling the Proxy.newProxyInstance method, which combines the actions of calling Proxy.getProxyClass with invoking the constructor with an invocation handler.
zh_cn: 并非必须使用反射 API 才能访问公共构造方法，通过调用 Proxy.newProxyInstance 方法（将调用 Proxy.getProxyClass 的操作和调用带有调用处理程序的构造方法结合在一起）也可以创建代理实例。

source: Reachability
zh_cn: 可到达性

source: Read and ignore number of buckets
zh_cn: 读取并忽略存储桶数

source: Read in the threshold (ignored), loadfactor, and any hidden stuff
zh_cn: 读取阈值(忽略)、加载因子和任何隐藏的内容

source: Read number of mappings (size)
zh_cn: 读取映射数(大小)

source: Read the keys and values, and put the mappings in the HashMap
zh_cn: 读取键和值，并将映射放到 HashMap 中

source: Reads text from a character-input stream, buffering characters so as to provide for the efficient reading of characters, arrays, and lines.
zh_cn: 从字符输入流中读取文本，缓冲各个字符，从而实现字符、数组和行的高效读取。

source: Reassigns the "standard" error output stream.
zh_cn: 重新分配“标准”错误输出流。

source: Reassigns the "standard" input stream.
zh_cn: 重新分配“标准”输入流。

source: Reassigns the "standard" output stream.
zh_cn: 重新分配“标准”输出流。

source: Reconstitute the HashMap instance from a stream (i.e., deserialize it).
zh_cn: 从流中重建 HashMap 实例(即反序列化它)。

source: Recursive invariant check
zh_cn: 递归不变检查

source: Red-black tree methods, all adapted from CLR
zh_cn: 红黑树方法，全部改编自 CLR

source: Refer to Unicode Character Representation for details.
zh_cn: 有关详细信息，请参阅 Unicode 字符表示形式。

source: Reference queues are implemented by the ReferenceQueue class.
zh_cn: 引用队列是通过 ReferenceQueue 类实现的。

source: Reference queues, to which registered reference objects are appended by the garbage collector after the appropriate reachability changes are detected.
zh_cn: 引用队列，在检测到适当的可到达性更改后，垃圾回收器将已注册的引用对象添加到该队列中。

source: References that are cleared too early cause unnecessary work; those that are cleared too late waste memory.
zh_cn: 过早清除的引用会导致不必要的工作；太晚清除的引用会浪费内存。

source: Reflection allows programmatic access to information about the fields, methods and constructors of loaded classes, and the use of reflected fields, methods, and constructors to operate on their underlying counterparts, within security restrictions.
zh_cn: 在安全限制内，反射允许编程访问关于加载类的字段、方法和构造方法的信息，并允许使用反射字段、方法和构造方法对其底层对等项进行操作。

source: Registers a new virtual-machine shutdown hook.
zh_cn: 注册新的虚拟机来关闭钩子。

source: Registers the caller as parallel capable.
zh_cn: 将调用者注册为可并行。

source: Rejected tasks
zh_cn: 被拒绝的任务

source: Related Documentation
zh_cn: 相关文档

source: Relink into lo and hi lists, preserving order
zh_cn: 重新链接到 lo 和 hi 列表，保持顺序

source: Removes all of the mappings from this map (optional operation).
zh_cn: 从此映射中移除所有映射关系（可选操作）。

source: Removes all of the mappings from this map.
zh_cn: 从此映射中移除所有映射关系。

source: Removes the char at the specified position in this sequence.
zh_cn: 移除此序列指定位置上的 char。

source: Removes the characters in a substring of this sequence.
zh_cn: 移除此序列的子字符串中的字符。

source: Removes the current thread's value for this thread-local variable.
zh_cn: 移除此线程局部变量当前线程的值。

source: Removes the entry for the specified key only if it is currently mapped to the specified value.
zh_cn: 仅当指定项当前映射到指定值时，才删除该项。

source: Removes the given node, that must be present before this call.
zh_cn: 删除给定的节点，该节点必须在此调用之前存在。

source: Removes the mapping for a key from this map if it is present (optional operation).
zh_cn: 如果存在一个键的映射关系，则将其从此映射中移除（可选操作）。

source: Removes the mapping for the specified key from this map if present.
zh_cn: 从此映射中移除指定键的映射关系（如果存在）。

source: Removes the next reference object in this queue, blocking until either one becomes available or the given timeout period expires.
zh_cn: 移除此队列中的下一个引用对象，阻塞到有一个对象变得可用或者给定的超时期满了为止。

source: Removes the next reference object in this queue, blocking until one becomes available.
zh_cn: 移除此队列中的下一个引用对象，阻塞到某个对象变得可用为止。

source: Removes the system property indicated by the specified key.
zh_cn: 移除指定键指示的系统属性。

source: Removes this task from the executor's internal queue if it is present, thus causing it not to be run if it has not already started.
zh_cn: 从执行程序的内部队列中移除此任务（如果存在），从而如果尚未开始，则其不再运行。

source: Repeated creation of a parameterized type has no effect.
zh_cn: 重复创建的参数化类型无效。

source: Repeated creation of a type variable has no effect.
zh_cn: 重复创建类型变量没有效果。

source: Replaced by defineClass(String, byte[], int, int)
zh_cn: 由 defineClass(String, byte[], int, int) 取代
